perf/rates.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 5000
  phases:
    - name: Warmup
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: Read baseline
      duration: 120
      arrivalRate: 100
    - name: Read peak
      duration: 60
      arrivalRate: 2000

scenarios:
  - name: Rates (/rates)
    weight: 70
    flow:
      - get:
          url: '/rates'

  - name: Accounts (/accounts)
    weight: 20
    flow:
      - get:
          url: '/accounts'

  - name: Logs first page (/logs)
    weight: 10
    flow:
      - get:
          url: '/logs?page=1&limit=50'